In [4]:
import numpy as np
import pandas as pd

data = pd.Series(np.random.randn(9),
         index = [['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                  [1, 2, 3, 1, 2, 3, 1, 2, 3]
                 ]
         )
data

a  1    0.637434
   2   -0.739481
   3    1.588287
b  1    1.915549
   2    1.085879
c  3   -0.746070
   1    0.679337
d  2    0.729539
   3    1.931621
dtype: float64

In [6]:
data['a']

1    0.637434
2   -0.739481
3    1.588287
dtype: float64

In [7]:
data[['a','c']]

a  1    0.637434
   2   -0.739481
   3    1.588287
c  3   -0.746070
   1    0.679337
dtype: float64

In [11]:
newData = data.unstack()
newData

          1         2         3
a  0.637434 -0.739481  1.588287
b  1.915549  1.085879       NaN
c  0.679337       NaN -0.746070
d       NaN  0.729539  1.931621

In [13]:
newData.stack()

a  1    0.637434
   2   -0.739481
   3    1.588287
b  1    1.915549
   2    1.085879
c  1    0.679337
   3   -0.746070
d  2    0.729539
   3    1.931621
dtype: float64

In [14]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                    index=[['a','a','b','b'],[1, 2, 1, 2]],
                    columns=[['台北','台北','台中'],['Green','Red','Green']])
frame

       台北        台中
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [15]:
frame.index.names = ['key1','key2']
frame.columns.names = ['縣市','顏色']
frame

縣市           台北        台中
顏色        Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [18]:
frame['台北']

顏色         Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [20]:
frame.loc['a']

縣市      台北        台中
顏色   Green Red Green
key2
1        0   1     2
2        3   4     5

In [21]:
#set_index()
#reset_index()
frame = pd.DataFrame({'a':range(7), 'b':range(7, 0, -1),
                     'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                     'd':[0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [22]:
frame2=frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [25]:
frame3=frame2.reset_index()

In [27]:
frame3.reindex(columns=['a','b','c','d'])

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3